browser-load-test-pw.yml
config:
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: 'http://{{ metrics_url }}:9091'
        tags:
          - 'testName:{{ test_name }}'
  target: "https://playwright.dev/"
  phases:
    - arrivalRate: 1
      duration: 10
      maxVusers: 3
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "playwright_dev_website"
    engine: playwright
    flowFunction: "checkOutPlayWrightFlow"