browser-load-test-pw.yml
config:
  plugins:
    publish-metrics:
      - type: 'open-telemetry'
        serviceName: '{{ service_name }}'
        # Set attributes for all resources (metrics and traces):
        resourceAttributes:
          custom-attribute: '{{ test_id }}'
        metrics:
          endpoint: 'http://{{ metrics_url }}:14269/metrics'
        traces:
          endpoint: 'http://{{ metrics_url }}:4318/v1/traces'
      - type: prometheus
        pushgateway: 'http://{{ metrics_url }}:9091'
        tags:
          - '{{ test_id }}'
  target: "https://playwright.dev/"
  phases:
    - arrivalRate: 1
      duration: 10
      maxVusers: 1
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "playwright_dev_website"
    engine: playwright
    flowFunction: "checkOutPlayWrightFlow"