browser-load-test-pw.yml
config:
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: 'http://{{ metrics_url }}:9091'
        tags:
          - 'testName:{{ test_name }}'
      - type: 'open-telemetry'
        serviceName: '{{ service_name }}'
        # Set attributes for all resources (metrics and traces):
        resourceAttributes:
          testName: '{{ test_name }}'
        smartSampling:
          thresholds:
            firstByte: 500
        metrics:
          endpoint: 'http://{{ metrics_url }}:14269/v1/metrics'
        traces:
          endpoint: 'http://{{ metrics_url }}:4318/v1/traces'
  target: "https://playwright.dev/"
  phases:
    - arrivalRate: 1
      duration: 180
      maxVusers: 3
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "playwright_dev_website"
    engine: playwright
    flowFunction: "checkOutPlayWrightFlow"