browser-load-test-pw.yml
config:
  plugins:
    publish-metrics:
      - type: 'open-telemetry'
        serviceName: '{{ service_name }}'
        # Set attributes for all resources (metrics and traces):
        resourceAttributes:
          testName: '{{ test_name }}'
        metrics:
          endpoint: 'http://{{ metrics_url }}:14269/v1/metrics'
        traces:
          endpoint: 'http://{{ metrics_url }}:4318/v1/traces'
      - type: prometheus
        pushgateway: 'http://{{ metrics_url }}:9091'
        tags:
          - 'testName:{{ test_name }}'
      - type: cloudwatch
        region: us-east-1
        namespace: continous-testing
        dimensions:
          - name: Team
            value: SQA
          - name: my-service
            value: checkout-svc
        traces:
          serviceName: my-service
          useRequestNames: true
          annotations:
            testType: LoadTest
            tool: Artillery
  target: "https://playwright.dev/"
  phases:
    - arrivalRate: 1
      duration: 10
      maxVusers: 1
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "playwright_dev_website"
    engine: playwright
    flowFunction: "checkOutPlayWrightFlow"