browser-load-test-pw.yml
config:
  #plugins:
    #publish-metrics:
      #- type: prometheus
        #pushgateway: 'http://{{ metrics_url }}:9091'
        #tags:
          #- 'testName:{{ test_name }}'
      #- type: 'open-telemetry'
        #serviceName: '{{ service_name }}'
        # Set attributes for all resources (metrics and traces):
        #resourceAttributes:
          #testName: '{{ test_name }}'
        #metrics:
          #endpoint: 'http://{{ metrics_url }}:14269/v1/metrics'
        #traces:
          #endpoint: 'http://{{ metrics_url }}:4318/v1/traces'
  target: "https://playwright.dev/"
  phases:
    - duration: '10s'
      arrivalRate: 1
      rampTo: 5
      maxVusers: 5
      name: 'RampUp Phase'
    - duration: '10m'
      arrivalRate: 1
      maxVusers: 5
      name: 'Actual Load for 10 min'
  engines:
    playwright:
      extendedMetrics: true
      aggregateByName: '{{ aggregate_by_name }}'
  processor: ./flows.js
scenarios:
  - name: "playwright_dev_website"
    engine: playwright
    flowFunction: "checkOutPlayWrightFlow"