browser-load-test.yml
config:
  plugins:
    publish-metrics:
    - type: 'open-telemetry'
      serviceName: 'artillery_poc'
      # Set attributes for all resources (metrics and traces):
      resourceAttributes:
        custom-attribute: 'playwright-test'
      metrics:
        endpoint: 'http://3.91.200.57:4318'
      traces:
        endpoint: 'http://3.91.200.57:4317'
        #endpoint: 'http://100.24.113.139:14268/api/traces'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"