browser-load-test.yml
config:
  #plugins:
    #publish-metrics:
      #- type: 'open-telemetry'
        #serviceName: 'artillery-load-test'
        # Set attributes for all resources (metrics and traces):
        #resourceAttributes:
          #custom-attribute: 'testId:browser-load-test'
        #metrics:
          #endpoint: 'http://44.202.187.224:14269/metrics'
        #traces:
          #endpoint: 'http://44.202.187.224:4318/v1/traces'
      #- type: prometheus
        #pushgateway: 'http://44.202.187.224:9091'
        #tags:
          #- 'testId:browser-load-test'
          #- 'type:loadtest'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
      maxVusers: 1
  engines:
    playwright: { aggregateByName: true }
      extendedMetrics: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"