browser-load-test.yml
config:
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: 'http://3.231.53.41:9091'
        tags:
          - 'testId:browser-load-test'
          - 'type:artillery-playwright-loadtest'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"