browser-load-test.yml
config:
  plugins:
    publish-metrics:
    - type: 'open-telemetry'
      serviceName: 'artillery-load-test'
      # Set attributes for all resources (metrics and traces):
      resourceAttributes:
        custom-attribute: 'playwright-artillery'
      metrics:
        endpoint: 'http://52.205.204.190:14269/metrics'
      traces:
        endpoint: 'http://52.205.204.190:4318/v1/traces'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"