browser-load-test.yml
config:
  plugins:
    publish-metrics:
      - type: "open-telemetry"
        serviceName: "artillery"
        metrics:
          reporter: otlp-http
          endpoint: "http://54.160.208.70:4318/v1/metrics"
          attributes:
            environment: "test"
            tool: "Artillery"
            type: "Load test"

        traces:
          reporter: otlp-http
          endpoint: "http://54.160.208.70:4318/v1/traces"
          attributes:
            environment: "test"
            tool: "Artillery"
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"