browser-load-test.yml
config:
  plugins:
    publish-metrics:
      - type: influxdb-statsd
        apiKey: '3BB4JWCVcbh2RXEuJ4GUfaPojx49lkvRgFtMqoz4AyMK2CwOxkTebp8JX8qyvXZ-HrgesFuQk1opziT9Nwe7jg=='
        prefix: 'artillery.publish_metrics_plugin.'
        tags:
          - 'testId:{{ $testId }}'
          - 'reporterType:influxdb-statsd'
        event:
          priority: low
          tags:
            - 'testId:{{ $testId }}'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      trace: true
  processor: ./flows.js
scenarios:
  - name: "check_out_core_concepts_scenario"
    engine: playwright
    flowFunction: "checkOutArtilleryCoreConceptsFlow"