browser-test-with-steps.yml
config:
  plugins:
    publish-metrics:
    - type: 'open-telemetry'
      serviceName: 'artillery_poc'
      # Set attributes for all resources (metrics and traces):
      resourceAttributes:
        custom-attribute: 'playwright-test'
      metrics:
        endpoint: 'http://100.24.113.139:14269/metrics'
      traces:
        endpoint: 'http://100.24.113.139:4318/v1/traces'
  target: "https://www.artillery.io"
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright: {}
  processor: ./flows.js
scenarios:
  - name: flow_with_multiple_steps
    engine: playwright
    flowFunction: "multistepWithCustomMetrics"